# DS-SF-34 | 03 | Databases, Scrapping, and APIs | Codealong | Starter Code

# Part A | RDBMS Databases and `SQLite`

In [29]:
import os

import pandas as pd
pd.set_option('display.max_rows', 10)
pd.set_option('display.notebook_repr_html', True)
pd.set_option('display.max_columns', 100)

import sqlite3

> ### How to connect to a `SQLite` database

In [5]:
db = sqlite3.connect(os.path.join('..', 'datasets', 'dataset-03-zillow.db'))

> ### How to use `pandas` to run SQL queries and get the results as a `DataFrame`

In [6]:
pd.io.sql.read_sql(
'''
SELECT *
    FROM properties
    LIMIT 10
;
''', con = db)

,id,address,...,lot_size_unit,built_in_year
0,15063471,"55 Vandewater St APT 9, San Francisco, CA",...,None,1980.0
1,15063505,"740 Francisco St, San Francisco, CA",...,sqft,1948.0
...,...,...,...,...,...
8,15064640,"1047-1049 Lombard St, San Francisco, CA",...,sqft,1948.0
9,15064669,"1055 Lombard St # C, San Francisco, CA",...,None,1986.0

### `SELECT`

In [7]:
pd.io.sql.read_sql(
'''
SELECT id, sale_price, sale_price_unit
    FROM transactions
;
''', con = db)

             id  sale_price sale_price_unit
0      15063471   710000.00               $
1      15063505        2.15              $M
..          ...         ...             ...
998  2131957929   835000.00               $
999  2136213970   825000.00               $

[1000 rows x 3 columns]

### `WHERE`

In [8]:
pd.io.sql.read_sql(
'''
SELECT id, sale_price
    FROM transactions
    WHERE sale_price_unit = '$M'
;
''', con = db)

             id  sale_price
0      15063505        2.15
1      15063609        5.60
..          ...         ...
573  2121221385        1.43
574  2122992200        2.75

[575 rows x 2 columns]

> #### Here's let's convert the unit of `sale_price` from \$ to \$M

In [10]:
pd.io.sql.read_sql(
'''
SELECT id, sale_price / 1000000 AS sale_price
    FROM transactions
    WHERE sale_price_unit = '$'
;
''', con = db)

             id  sale_price
0      15063471       0.710
1      15064257       0.970
..          ...         ...
423  2131957929       0.835
424  2136213970       0.825

[425 rows x 2 columns]

### `UNION`

> #### Let's combine the previous two queries into one.  `sale_price` is now in \$M accross the dataset

In [18]:
pd.io.sql.read_sql('''
SELECT id, sale_price / 1000000 AS sale_price, sale_price_unit
    FROM transactions
    WHERE sale_price_unit = '$'
UNION ALL
SELECT id, sale_price, sale_price_unit
    FROM transactions
    WHERE sale_price_unit = '$M'
;
''', con = db)

             id  sale_price sale_price_unit
0      15063471        0.71               $
1      15064257        0.97               $
..          ...         ...             ...
998  2121221385        1.43              $M
999  2122992200        2.75              $M

[1000 rows x 3 columns]

### `WITH`

In [19]:
pd.io.sql.read_sql(
'''
WITH normalized_sale_prices AS
    (SELECT id, sale_price / 1000000 AS sale_price
        FROM transactions
        WHERE sale_price_unit = '$'
    UNION ALL
    SELECT id, sale_price
        FROM transactions
        WHERE sale_price_unit = '$M')

SELECT *
    FROM normalized_sale_prices
;
''', con = db)

             id  sale_price
0      15063471        0.71
1      15064257        0.97
..          ...         ...
998  2121221385        1.43
999  2122992200        2.75

[1000 rows x 2 columns]

### `JOIN`

In [20]:
pd.io.sql.read_sql(
'''
WITH normalized_sale_prices AS
    (SELECT id, sale_price / 1000000 AS sale_price
        FROM transactions
        WHERE sale_price_unit = '$'
    UNION ALL
    SELECT id, sale_price
        FROM transactions
        WHERE sale_price_unit = '$M')

SELECT properties.beds AS beds, normalized_sale_prices.sale_price AS sale_price
    FROM properties
    JOIN normalized_sale_prices
        ON normalized_sale_prices.id = properties.id
;
''', con = db)

     beds  sale_price
0     1.0        0.71
1     2.0        0.97
..    ...         ...
998   NaN        1.43
999   NaN        2.75

[1000 rows x 2 columns]

### `WITH` (take 2)

In [22]:
pd.io.sql.read_sql(
'''
WITH normalized_sale_prices AS
    (SELECT id, sale_price / 1000000 AS sale_price
        FROM transactions
        WHERE sale_price_unit = '$'
    UNION ALL
    SELECT id, sale_price
        FROM transactions
        WHERE sale_price_unit = '$M'),

beds_normalized_sale_prices AS
    (SELECT properties.beds AS beds, normalized_sale_prices.sale_price AS sale_price
        FROM properties
        JOIN normalized_sale_prices
            ON normalized_sale_prices.id = properties.id)

SELECT *
    FROM beds_normalized_sale_prices
;
''', con = db)

     beds  sale_price
0     1.0        0.71
1     2.0        0.97
..    ...         ...
998   NaN        1.43
999   NaN        2.75

[1000 rows x 2 columns]

### `GROUP BY` and `AVG`

> ### Let's now compute the average sale price of these properties based on their number of bedrooms

In [23]:
pd.io.sql.read_sql(
'''
WITH normalized_sale_prices AS
    (SELECT id, sale_price / 1000000 AS sale_price
        FROM transactions
        WHERE sale_price_unit = '$'
    UNION ALL
    SELECT id, sale_price
        FROM transactions
        WHERE sale_price_unit = '$M'),

beds_normalized_sale_prices AS
    (SELECT properties.beds AS beds, normalized_sale_prices.sale_price AS sale_price
        FROM properties
        JOIN normalized_sale_prices
            ON normalized_sale_prices.id = properties.id)

SELECT AVG(sale_price) AS mean_sale_price
    FROM beds_normalized_sale_prices
    GROUP BY beds
;
''', con = db)

    mean_sale_price
0          1.494858
1          0.820425
..              ...
8          1.960000
9          1.766667

[10 rows x 1 columns]

Note: `beds = 0` usually refers to studios but not always...

> ### Activity
> #### Compute the average sales price of studios

In [56]:
pd.io.sql.read_sql(
'''
WITH normalized_sale_prices AS
    (SELECT id, sale_price / 1000000 AS sale_price
        FROM transactions
        WHERE sale_price_unit = '$'
    UNION ALL
    SELECT id, sale_price
        FROM transactions
        WHERE sale_price_unit = '$M'),

beds_normalized_sale_prices AS
    (SELECT properties.beds AS beds, normalized_sale_prices.sale_price AS sale_price, is_a_studio
        FROM properties
        JOIN normalized_sale_prices
            ON normalized_sale_prices.id = properties.id)

SELECT AVG(sale_price) AS mean_sale_price
    FROM beds_normalized_sale_prices
    WHERE is_a_studio = 1
    GROUP BY beds
;
''', con = db)

   mean_sale_price
0         1.464034

> ### Activity
> #### Find the properties in the dataset that have different addresses but the same latitude/longitude.  Return the smallest set of pair of properties (`address_a`, `address_b`)

In [86]:
pd.io.sql.read_sql(
'''
WITH id_lat_long AS (
    SELECT id, latitude, longitude
        FROM PROPERTIES)

SELECT count()
    FROM id_lat_long AS a, id_lat_long as b
    WHERE (a.latitude = b.latitude)
        AND (a.longitude = b.longitude)
        AND (a.id < b.id)
;
''', con=db)

   count()
0      108